/* 
（2）计算下述各表达式的值并输出：
'A' + 3；
'6' – 48； 
'a'- 'A'；
2*'0' + 'a'/10； 
30/8 + 30%8 + 30/8.0； 
1>2 || 2>1；
9>5 && 5>2； 
9>5>2； 
false || !(1!=2 && false)；
*/
#include <stdio.h>
int main()
{
    printf("第一个表达式:‘A'+3=%d\n", 'A' + 3);
    printf("第二个表达式:'6'-48=%d\n", '6' - 48);
    printf("第三个表达式'a'-'A':%d\n", 'a' - 'A');
    printf("第四个表达式:2*'0' + 'a'/10=%d\n", 2 * '0' + 'a' / 10);
    // % 在输出时要转义 %% 来代替一个 %
    printf("第四个表达式:30/8 + 30%%8 + 30/8.0=%f\n", 30 / 8 + 30 % 8 + 30 / 8.0);
    printf("第五个表达式:1>2 || 2>1=%d\n", 1 > 2 || 2 > 1);
    printf("第六个表达式:9>5 && 5>2=%d\n", 9 > 5 && 5 > 2);
    printf("第七个表达式:9>5>2=%d\n", 9 > 5 > 2);
    // 题目错了？
    // printf("第八个表达式:false || !(1!=2 && false)=%d\n",false || !(1!=2 && false))
    return 0;
}