/*（2）已知整型数组a中有若干元素的值为零，编写函数int func(int *a, int n)，
将a中的零移至数组后面，非零整数移至数组前面并从小到大排序。形参n表示数组中元素的个数，
函数返回原数组中第一个值为零的元素的下标。
在main函数中调用该函数。*/
#include <stdio.h>
int func(int *a, int n) {
    // 将a中的零移至数组后面
    // 用来存放 0 的数量
    int n0 = 0;
    //  先把 0 全部扔到后面去
    for (int i = 0; i < n; i++) {
        if (*(a + i) == 0) {
            // 把 0 和含 0 的最后一项交换位置
            *(a + i) = *(a + n - n0 - 1);
            *(a + n - n0 - 1) = 0;
            // 记得计数
            n0++;
        }
    }
    // 非零整数移至数组前面并从小到大排序。
    // 再使用冒泡法排序
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < (n - 1); j++) {
            // 这一项大于后一项，那就交换这一项与后一项的位置
            if ((*(a + j) > *(a + j + 1))) {
                int tmp = *(a + j);
                *(a + j) = *(a + j + 1);
                *(a + j + 1) = tmp;
            }
        }
    }
    // 函数返回原数组中第一个值为零的元素的下标。
    return *(a + (n - n0) + 1);
}
int main() {
    //形参n表示数组中元素的个数，
    int n = 7;
    int a[] = {5, 4, 0, 2, 3, 0, 1};
    printf("%dfuck\n", func(a, n));
    for (int i = 0; i < 7; i++) {
        printf("%d\n", a[i]);
    }

    return 0;
}