/*（2）已知整型数组a中有若干元素的值为零，编写函数int func(int *a, int n)，
将a中的零移至数组后面，非零整数移至数组前面并从小到大排序。形参n表示数组中元素的个数，
函数返回原数组中第一个值为零的元素的下标。
在main函数中调用该函数。*/
#include <stdio.h>
int func(int *a, int n) {
    // 将a中的零移至数组后面
    // 用来存放 0 的数量
    int n0 = 0;
    // 第一个值为零的元素的下标
    // 初值只要不大于等于 0 就行
    int p0 = -1;
    for (int i = 0; i < n; i++) {
        // 如果是 0 ，n0 就加一
        if (*(a + i) == 0) {
            n0++;
            // 寻找第一个 0
            if (p0 == -1) {
                p0 = i;
            }
        }
    }
    // printf("n0 = %d\n", n0);
    // 使用冒泡法排序
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < (n - 1); j++) {
            // 这一项大于后一项，那就交换这一项与后一项的位置
            if ((*(a + j) > *(a + j + 1))) {
                int tmp = *(a + j);
                *(a + j) = *(a + j + 1);
                *(a + j + 1) = tmp;
            }
        }
    }
    // 再把 0 往后丢
    // 当 n = 7,n0 = 3 时
    // 经过分析只需要进行下面4=(7-3)次交换，就可以达到目的
    //  a[0]<->a[3=(0+3)],a[1]<->a[4=(1+3)],a[2]<->a[5=(2+3)],a[3]<->a[6=(3+3)]
    // 找规律，可以得到下面的算法
    for (int i = 0; i < (n - n0); i++) {
        int tmp = *(a + i + n0);
        *(a + i + n0) = *(a + i);
        *(a + i) = tmp;
    }
    // 函数返回原数组中第一个值为零的元素的下标。
    return p0;
}
int main() {
    //形参n表示数组中元素的个数，
    int n = 7;
    int a[] = {0, 4, 1, 2, 0, 0, 1};
    printf("原数组中第一个值为零的元素的下标:%d\n", func(a, n));
    for (int i = 0; i < 7; i++) {
        printf("%3d ", a[i]);
    }
    printf("\n");
    return 0;
}